{
  "architectures": [
    "FlaxWBertForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 512,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 1024,
  "model_type": "waveformer",
  "num_attention_heads": 8,
  "num_hidden_layers": 8,
  "pad_token_id": 50256,
  "position_embedding_type": "absolute",
  "transformers_version": "4.6.0.dev0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 50260,
  "wlen": 16,
  "level": 1,
  "wav_dim": 512
}
